app/controllers/customers_controller.rb

  def authenticate
    authenticated = false
    json_resp = {
        ok: authenticated
    }
    if !params[:username].blank? and !params[:password].blank?
      if Customer.find_by(name: params[:username])
        customer = Customer.find_by(name: params[:username])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."name" = ? LIMIT ?  [["name", "Julius"], ["LIMIT", 1]]