app/controllers/datasets_controller.rb

  def index
    @datasets = Dataset.all
---
SELECT "datasets".* FROM "datasets"

  def progress
    relative_progress = ((@dataset.labels.count / @dataset.goal) * 100).round(2)
---
SELECT COUNT(*) FROM "labels" INNER JOIN "images" ON "labels"."image_id" = "images"."id" WHERE "images"."dataset_id" = ?  [["dataset_id", 1]]

  def label_stats
    chart_json = []
    colors = ["hsl(237, 70%, 50%)", "hsl(235, 70%, 50%)", "hsl(22, 70%, 50%)", "hsl(129, 70%, 50%)", "hsl(89, 70%, 50%)"]

    @dataset.dataset_classes.each_with_index do | dataset_class, index |
      slice_obj = {
          id: dataset_class.name,
          label: dataset_class.name,
          value: dataset_class.labels.count,
          color: colors[index]
---
SELECT COUNT(*) FROM "labels" WHERE "labels"."dataset_class_id" = ?  [["dataset_class_id", 1]]

    def set_dataset
      @dataset = Dataset.find(params[:id])
---
SELECT  "datasets".* FROM "datasets" WHERE "datasets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]