app/controllers/dataset_classes_controller.rb

  def index
    @dataset_classes = DatasetClass.all
---
SELECT "dataset_classes".* FROM "dataset_classes"