app/controllers/images_controller.rb

SELECT  "dataset_classes".* FROM "dataset_classes" WHERE "dataset_classes"."name" = ? LIMIT ?  [["name", "Cat"], ["LIMIT", 1]]
---
  def training_sample
    offset = rand(Image.count)
    random_image = Image.offset(offset).first

    json_resp = {
        labels: [],
        image: {
          id: random_image.id,
          imageSrc: random_image.file_path
        }
    }

    conn = Faraday.new(url: 'http://localhost:5000')

    response = conn.get 'http://localhost:5000/classify?file_path=' + random_image.file_path + '&dataset=' + random_image.dataset.name

    suggested_labels = JSON.parse(response.body).values[0]

    if suggested_labels.count > 5
      suggested_labels = suggested_labels[0..4]
    end

    suggested_labels.each do |suggested_label|
      next unless DatasetClass.find_by(name: suggested_label)