app/controllers/images_controller.rb

  def training_sample
    render json: {error: "user_id missing"} unless not params[:user_id].blank?
    render json: {error: "user does not exist"} unless User.find_by(id: params[:user_id])

    offset = rand(Image.count)
    random_image = Image.offset(offset).first

    labeled_images_ids = User.find_by(id: params[:user_id]).labels.map { |label| label.image.id }
    not_yet_labeled_images = Image.where(["id NOT IN (?)", labeled_images_ids]).shuffle

    random_image = not_yet_labeled_images[0] if not_yet_labeled_images.count > 0

    json_resp = {
        labels: [],
        id: random_image.id,
        imageSrc: random_image.file_path
    }

    conn = Faraday.new(url: 'http://localhost:5000')

    response = conn.get 'http://localhost:5000/classify?file_path=' + random_image.file_path + '&dataset=' + random_image.dataset.name

    suggested_labels = JSON.parse(response.body).values[0]

    if suggested_labels.count > 5
      suggested_labels = suggested_labels[0..4]
    end

    suggested_labels.each do |suggested_label|
      next unless DatasetClass.find_by(name: suggested_label)

      dataset_class = DatasetClass.find_by(name: suggested_label)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "images"
SELECT  "images".* FROM "images" ORDER BY "images"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 2]]
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "labels".* FROM "labels" WHERE "labels"."user_id" = ?  [["user_id", 1]]
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "datasets".* FROM "datasets" WHERE "datasets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "images".* FROM "images" WHERE (id NOT IN (NULL))
SELECT  "dataset_classes".* FROM "dataset_classes" WHERE "dataset_classes"."name" = ? LIMIT ?  [["name", "Whiskers"], ["LIMIT", 1]]
SELECT  "dataset_classes".* FROM "dataset_classes" WHERE "dataset_classes"."name" = ? LIMIT ?  [["name", "Adaptation"], ["LIMIT", 1]]

          id: dataset_class.id
      }

      json_resp[:labels].push(dataset_class_obj)
---
INSERT INTO "labels" ("x_pos", "y_pos", "user_id", "dataset_class_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)