app/controllers/labels_controller.rb

  def create
    @label = Label.new(label_params)

    if @label.save
      if @label.dataset.labels.count > 10 and @label.dataset.labels.count % 10 == 0
        json_body = {
          dataset: @label.dataset.id,
          data: []
        }

        @label.dataset.images.each do |image|
          if image.labels.count > 0
---
SELECT COUNT(*) FROM "labels" INNER JOIN "images" ON "labels"."image_id" = "images"."id" WHERE "images"."dataset_id" = ?  [["dataset_id", 1]]
SELECT  "datasets".* FROM "datasets" WHERE "datasets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "images".* FROM "images" ORDER BY "images"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 8]]
SELECT "labels".* FROM "labels" INNER JOIN "images" ON "labels"."image_id" = "images"."id" WHERE "images"."dataset_id" = ?  [["dataset_id", 1]]
SELECT COUNT(*) FROM "labels" WHERE "labels"."image_id" = ?  [["image_id", 1]]