app/controllers/labels_controller.rb

SELECT "labels".* FROM "labels"
---
  def index
    @labels = Label.all

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "dataset_classes".* FROM "dataset_classes" WHERE "dataset_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "labels" ("x_pos", "y_pos", "user_id", "dataset_class_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["x_pos", 0.5], ["y_pos", 0.2], ["user_id", 1], ["dataset_class_id", 1], ["image_id", 1], ["created_at", "2019-03-12 10:55:39.624062"], ["updated_at", "2019-03-12 10:55:39.624062"]]
---
  def label_placement
    saved = false

    if !params[:user_id].blank? and !params[:image_id].blank?
      if User.find_by(id: params[:user_id]) and Image.find_by(id: params[:image_id])
        user = User.find_by(id: params[:user_id])
        image = Image.find_by(id: params[:image_id])
        saved = true
        params[:labels].each do |label_obj|
          dataset_class = DatasetClass.find_by(id: label_obj[:id])
          Label.create(user: user, image: image, dataset_class: dataset_class, x_pos: label_obj[:x], y_pos: label_obj[:y])

INSERT INTO "labels" ("x_pos", "y_pos", "user_id", "dataset_class_id", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["x_pos", 0.1], ["y_pos", 0.2], ["user_id", 2], ["dataset_class_id", 3], ["image_id", 1], ["created_at", "2019-03-11 14:34:21.052536"], ["updated_at", "2019-03-11 14:34:21.052536"]]
SELECT COUNT(*) FROM "labels" INNER JOIN "images" ON "labels"."image_id" = "images"."id" WHERE "images"."dataset_id" = ?  [["dataset_id", 1]]
SELECT  "datasets".* FROM "datasets" WHERE "datasets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "images".* FROM "images" ORDER BY "images"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 1]]
SELECT "labels".* FROM "labels" INNER JOIN "images" ON "labels"."image_id" = "images"."id" WHERE "images"."dataset_id" = ?  [["dataset_id", 1]]
SELECT COUNT(*) FROM "labels" WHERE "labels"."image_id" = ?  [["image_id", 1]]
---
  def create
    @label = Label.new(label_params)

    if @label.save
      if @label.dataset.labels.count > 10 and @label.dataset.labels.count % 10 == 0
        json_body = {
          dataset: @label.dataset.id,
          data: []
        }

        @label.dataset.images.each do |image|
          if image.labels.count > 0

SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_label
      @label = Label.find(params[:id])