app/models/dataset.rb

  def self.labels_at(day, dataset_id)
    num_of_labels = Label.all.map { |label| labellabel.image.dataset.id == dataset_id ? 1 : 0}.to_a.sum
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]