app/models/dataset.rb

  def majority_class
    chosen_dataset_class_ids = []
    self.labels.each do |label|
      chosen_dataset_class_ids.push(label.dataset_class.id)
    end

    majority_label_id = chosen_dataset_class_ids.max_by{|x| chosen_dataset_class_ids.count(x) }
    return Label.find_by(id: majority_label_id)
---
SELECT "datasets".* FROM "datasets" WHERE "datasets"."created_at" = ?  [["created_at", "2019-03-05"]]
SELECT "labels".* FROM "labels" INNER JOIN "images" ON "labels"."image_id" = "images"."id" WHERE "images"."dataset_id" = ?  [["dataset_id", 1]]
SELECT  "datasets".* FROM "datasets" WHERE "datasets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]