app/models/image.rb

SELECT COUNT(*) FROM "labels" WHERE "labels"."image_id" = ?  [["image_id", 1]]
SELECT "labels".* FROM "labels" WHERE "labels"."image_id" = ?  [["image_id", 3]]
SELECT  "dataset_classes".* FROM "dataset_classes" WHERE "dataset_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def majority_class
    if self.labels.count > 0
      majority_dataset_class_id = mode(self.labels.map { |label| label.dataset_class.id }.to_a)[0]

      return DatasetClass.find_by(id: majority_dataset_class_id)